; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x6-y6-t3-k333-l333-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f 
        f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f 
        shape0 shape1 shape2 
        key0-0 key0-1 key0-2 
        key1-0 key1-1 key1-2 
        key2-0 key2-1 key2-2 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f5-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f5-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f5-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f5-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(place f5-4f)
(place f0-5f)
(place f1-5f)
(place f2-5f)
(place f3-5f)
(place f4-5f)
(place f5-5f)
(shape shape0)
(shape shape1)
(shape shape2)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key0-2)
(key-shape key0-2 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key1-2)
(key-shape key1-2 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(key key2-2)
(key-shape key2-2 shape2)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f4-0f f5-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f4-1f f5-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f4-2f f5-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f4-3f f5-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f4-4f f5-4f)
(conn f0-5f f1-5f)
(conn f1-5f f2-5f)
(conn f2-5f f3-5f)
(conn f3-5f f4-5f)
(conn f4-5f f5-5f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f5-0f f5-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f5-1f f5-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f5-2f f5-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f5-3f f5-4f)
(conn f0-4f f0-5f)
(conn f1-4f f1-5f)
(conn f2-4f f2-5f)
(conn f3-4f f3-5f)
(conn f4-4f f4-5f)
(conn f5-4f f5-5f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f5-0f f4-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f5-1f f4-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f5-2f f4-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f5-3f f4-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f5-4f f4-4f)
(conn f1-5f f0-5f)
(conn f2-5f f1-5f)
(conn f3-5f f2-5f)
(conn f4-5f f3-5f)
(conn f5-5f f4-5f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f5-1f f5-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f5-2f f5-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f5-3f f5-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(conn f5-4f f5-3f)
(conn f0-5f f0-4f)
(conn f1-5f f1-4f)
(conn f2-5f f2-4f)
(conn f3-5f f3-4f)
(conn f4-5f f4-4f)
(conn f5-5f f5-4f)
(open f1-0f)
(open f2-0f)
(open f3-0f)
(open f4-0f)
(open f5-0f)
(open f0-1f)
(open f1-1f)
(open f2-1f)
(open f4-1f)
(open f0-2f)
(open f1-2f)
(open f2-2f)
(open f3-2f)
(open f5-2f)
(open f0-3f)
(open f1-3f)
(open f2-3f)
(open f3-3f)
(open f5-3f)
(open f0-4f)
(open f1-4f)
(open f2-4f)
(open f3-4f)
(open f5-4f)
(open f0-5f)
(open f1-5f)
(open f5-5f)
(locked f3-1f)
(lock-shape f3-1f shape0)
(locked f4-5f)
(lock-shape f4-5f shape0)
(locked f2-5f)
(lock-shape f2-5f shape0)
(locked f4-3f)
(lock-shape f4-3f shape1)
(locked f4-4f)
(lock-shape f4-4f shape1)
(locked f5-1f)
(lock-shape f5-1f shape1)
(locked f3-5f)
(lock-shape f3-5f shape2)
(locked f4-2f)
(lock-shape f4-2f shape2)
(locked f0-0f)
(lock-shape f0-0f shape2)
(at key0-0 f3-4f)
(at key0-1 f3-2f)
(at key0-2 f4-0f)
(at key1-0 f5-5f)
(at key1-1 f0-4f)
(at key1-2 f5-3f)
(at key2-0 f1-0f)
(at key2-1 f2-3f)
(at key2-2 f0-5f)
(at-robot f4-0f)
)
(:goal
(and
(at key0-2 f5-5f)
(at key1-1 f0-3f)
)
)
)

; plan
1. (pickup f4-0f key0-2)
   deleted: (at key0-2 f4-0f) (arm-empty)
   added: (holding key0-2)
   goals met: 0 of 2
2. (move f4-0f f3-0f)
   deleted: (at-robot f4-0f)
   added: (at-robot f3-0f)
   goals met: 0 of 2
3. (move f3-0f f2-0f)
   deleted: (at-robot f3-0f)
   added: (at-robot f2-0f)
   goals met: 0 of 2
4. (move f2-0f f1-0f)
   deleted: (at-robot f2-0f)
   added: (at-robot f1-0f)
   goals met: 0 of 2
5. (move f1-0f f1-1f)
   deleted: (at-robot f1-0f)
   added: (at-robot f1-1f)
   goals met: 0 of 2
6. (move f1-1f f1-2f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-2f)
   goals met: 0 of 2
7. (move f1-2f f1-3f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-3f)
   goals met: 0 of 2
8. (move f1-3f f0-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f0-3f)
   goals met: 0 of 2
9. (move f0-3f f0-4f)
   deleted: (at-robot f0-3f)
   added: (at-robot f0-4f)
   goals met: 0 of 2
10. (pickup-and-loose f0-4f key1-1 key0-2)
   deleted: (holding key0-2) (at key1-1 f0-4f)
   added: (holding key1-1) (at key0-2 f0-4f)
   goals met: 0 of 2
11. (move f0-4f f0-3f)
   deleted: (at-robot f0-4f)
   added: (at-robot f0-3f)
   goals met: 0 of 2
12. (putdown f0-3f key1-1)
   deleted: (holding key1-1)
   added: (arm-empty) (at key1-1 f0-3f)
   goals met: 1 of 2
13. (move f0-3f f0-4f)
   deleted: (at-robot f0-3f)
   added: (at-robot f0-4f)
   goals met: 1 of 2
14. (pickup f0-4f key0-2)
   deleted: (at key0-2 f0-4f) (arm-empty)
   added: (holding key0-2)
   goals met: 1 of 2
15. (move f0-4f f0-3f)
   deleted: (at-robot f0-4f)
   added: (at-robot f0-3f)
   goals met: 1 of 2
16. (pickup-and-loose f0-3f key1-1 key0-2)
   deleted: (holding key0-2) (at key1-1 f0-3f)
   added: (holding key1-1) (at key0-2 f0-3f)
   goals met: 0 of 2
17. (move f0-3f f1-3f)
   deleted: (at-robot f0-3f)
   added: (at-robot f1-3f)
   goals met: 0 of 2
18. (move f1-3f f2-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f2-3f)
   goals met: 0 of 2
19. (move f2-3f f3-3f)
   deleted: (at-robot f2-3f)
   added: (at-robot f3-3f)
   goals met: 0 of 2
20. (unlock f3-3f f4-3f key1-1 shape1)
   deleted: (locked f4-3f)
   added: (open f4-3f)
   goals met: 0 of 2
21. (move f3-3f f2-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f2-3f)
   goals met: 0 of 2
22. (move f2-3f f1-3f)
   deleted: (at-robot f2-3f)
   added: (at-robot f1-3f)
   goals met: 0 of 2
23. (move f1-3f f0-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f0-3f)
   goals met: 0 of 2
24. (pickup-and-loose f0-3f key0-2 key1-1)
   deleted: (holding key1-1) (at key0-2 f0-3f)
   added: (holding key0-2) (at key1-1 f0-3f)
   goals met: 1 of 2
25. (move f0-3f f1-3f)
   deleted: (at-robot f0-3f)
   added: (at-robot f1-3f)
   goals met: 1 of 2
26. (move f1-3f f2-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f2-3f)
   goals met: 1 of 2
27. (move f2-3f f3-3f)
   deleted: (at-robot f2-3f)
   added: (at-robot f3-3f)
   goals met: 1 of 2
28. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 1 of 2
29. (move f4-3f f5-3f)
   deleted: (at-robot f4-3f)
   added: (at-robot f5-3f)
   goals met: 1 of 2
30. (move f5-3f f5-4f)
   deleted: (at-robot f5-3f)
   added: (at-robot f5-4f)
   goals met: 1 of 2
31. (move f5-4f f5-5f)
   deleted: (at-robot f5-4f)
   added: (at-robot f5-5f)
   goals met: 1 of 2
32. (putdown f5-5f key0-2)
   deleted: (holding key0-2)
   added: (arm-empty) (at key0-2 f5-5f)
   goals met: 2 of 2
